sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
  /* definition and creation of USART3_Task */
  osThreadDef(USART3_Task, usart3_entry, osPriorityNormal, 0, 128);
  USART3_TaskHandle = osThreadCreate(osThread(USART3_Task), NULL);

  /* definition and creation of IGNITION_Task */
  osThreadDef(IGNITION_Task, ignition_entry, osPriorityNormal, 0, 128);
  IGNITION_TaskHandle = osThreadCreate(osThread(IGNITION_Task), NULL);

  /* definition and creation of I2C1_Task */
  osThreadDef(I2C1_Task, i2c1_entry, osPriorityNormal, 0, 128);
  I2C1_TaskHandle = osThreadCreate(osThread(I2C1_Task), NULL);

  /* definition and creation of ADC_Task */
  osThreadDef(ADC_Task, adc_entry, osPriorityNormal, 0, 128);
  ADC_TaskHandle = osThreadCreate(osThread(ADC_Task), NULL);

  /* definition and creation of IWDG_Task */
  osThreadDef(IWDG_Task, IWDG_entry, osPriorityAboveNormal, 0, 128);
  IWDG_TaskHandle = osThreadCreate(osThread(IWDG_Task), NULL);

  /* definition and creation of CMD_PROC_Task */
  osThreadDef(CMD_PROC_Task, cmd_proc_entry, osPriorityNormal, 0, 128);
  CMD_PROC_TaskHandle = osThreadCreate(osThread(CMD_PROC_Task), NULL);

  /* definition and creation of GPIO_STATE_Task */
  osThreadDef(GPIO_STATE_Task, gpio_state_entry, osPriorityNormal, 0, 128);
  GPIO_STATE_TaskHandle = osThreadCreate(osThread(GPIO_STATE_Task), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
	/* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of GPIO_MISC_Q */
  osMessageQDef(GPIO_MISC_Q, 16, uint16_t);
  GPIO_MISC_QHandle = osMessageCreate(osMessageQ(GPIO_MISC_Q), NULL);

  /* definition and creation of ADC_VOLT_Q */
  osMessageQDef(ADC_VOLT_Q, 1, uint32_t);
  ADC_VOLT_QHandle = osMessageCreate(osMessageQ(ADC_VOLT_Q), NULL);

  /* definition and creation of ADC_TEMP_Q */
  osMessageQDef(ADC_TEMP_Q, 1, uint32_t);
  ADC_TEMP_QHandle = osMessageCreate(osMessageQ(ADC_TEMP_Q), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
}

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN StartDefaultTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END StartDefaultTask */
}

/* usart1_entry function */
void usart1_entry(void const * argument)
{
  /* USER CODE BEGIN usart1_entry */
	uint8_t recv1[CMD_MAX_LEN] = {0};
	uint8_t xFer[CMD_MAX_LEN] = {0};
	uint8_t write_back = FALSE;
	uint8_t send2host = FALSE;
	uint8_t xFer_len = 0;
	/* Infinite loop */

	for(;;)
    {
#if 1
		// Wait until the first byte is coming
		//while((HAL_UART_Receive(&huart1, &recv1[CMD_SYN_POS0], 1, 1)) != HAL_OK );
		// Get the SYN code.
		HAL_UART_Receive_DMA(&huart1, &recv1[CMD_SYN_POS1] ,(CMD_MAX_LEN - 1));
		// Give some time for DMA receiving data. Let this thread take a break.
		osDelay(30);
		// Abort UART processing.
		HAL_UART_Abort_IT(&huart1);
#else

		// Wait until the first byte is coming
		if ((HAL_UART_Receive(&huart1, &recv1[CMD_SYN_POS0], 1, 1)) == HAL_OK ){
			// Get the SYN code.
			HAL_UART_Receive_DMA(&huart1, &recv1[CMD_SYN_POS1] ,(CMD_MAX_LEN - 1));
			// Give some time for DMA receiving data. Let this thread take a break.
			osDelay(30);
			// Abort UART processing.
			HAL_UART_Abort_IT(&huart1);
		}
		else{
			continue;
		}
#endif
		// Check command head.
		if ((CMD_SYN_CODE == recv1[CMD_SYN_POS0]) && (CMD_SYN_CODE == recv1[CMD_SYN_POS1]) && (CMD_STX_CODE == recv1[CMD_STX_POS])){
			switch(recv1[CMD_MCMD_POS]){
				//-----------------------------------------------------
				case M_CMD_MCU_SETTING:
					switch(recv1[CMD_SCMD_POS]){
						//-----------------------------------------------------
						case Subcmd_MCU_FW_Ver:
							// Check tail codes.
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							xFer[2] = Subcmd_MCU_FW_Ver;
							xFer[3] = gIG_Event.major_ver;
							xFer[4] = gIG_Event.minor_ver;
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD10_LEN;
							aewin_dbg("\n\rHost get MCU version:%d.%d", xFer[3], xFer[4]);
							break;

						//-----------------------------------------------------
						case Subcmd_MCU_Get_Date:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE)])) break;
							HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							xFer[2] = Subcmd_MCU_Get_Date;
							xFer[3] = sDate.Year; 		// Year low byte.
							xFer[4] = 20; 				// Year high byte.
							xFer[5] = sDate.Month;		// Month.
							xFer[6] = sDate.Date;		// Date.
							xFer[7] = sTime.Hours;		// Hours.
							xFer[8] = sTime.Minutes;	// Minutes.
							xFer[9] = sTime.Seconds;	// Seconds.
							send2host = TRUE;
							xFer_len = MCU_REPO_HEAD_CMD_SIZE + MCU_SCMD20_LEN;
							aewin_dbg("\n\rGet Time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
							aewin_dbg("\n\rGet Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);
							break;


						//-----------------------------------------------------
						case Subcmd_MCU_Set_Date:
							if((CMD_ETX_CODE != recv1[CMD_ETX_POS(CMD_HEAD_MS_SIZE + MCU_SCMD21_LEN)]) || \
							   (CMD_EOT_CODE != recv1[CMD_EOT_POS(CMD_HEAD_MS_SIZE + MCU_SCMD21_LEN)])) break;
							// recv1[6] = 20, no need to change
							sDate.Year  = recv1[5]; 		// Year low byte.
							sDate.Month	= recv1[7];			// Month.
							sDate.Date  = recv1[8];			// Date.
							sTime.Hours = recv1[9];			// Hours.
							sTime.Minutes = recv1[10];;		// Minutes.
							sTime.Seconds = recv1[11];;		// Seconds.
							aewin_dbg("\n\rSet Time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
							aewin_dbg("\n\rSet Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);
							HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
							HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
							break;


						//-----------------------------------------------------
						case Subcmd_Get_Sys_InVOLT:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_Sys_InVOLT:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_RebootSrc:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_RebootSrc:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_BootMode:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_BootMode:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WWAN_WKStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_WKStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WWAN_Stat:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WWAN_Stat:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiIn:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DigiOut:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DigiOut:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_SIM_Mode:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_SIM_Mode:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_WIFI_OnOff:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_WIFI_OnOff:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_LAN_WKStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_LAN_WKStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOffStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOffStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOnStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOnStat:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOffTime:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOffTime:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_DelayOnTime:
							break;

						//-----------------------------------------------------
						case Subcmd_Set_DelayOnTime:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_ADC:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_GPS:
							break;

						//-----------------------------------------------------
						case Subcmd_Get_Gsensor:
							break;

						//-----------------------------------------------------
						case Subcmd_OS_Shutdown:
							break;

						//-----------------------------------------------------
						default:
							break;
					}
					break;
				//-----------------------------------------------------
				case M_CMD_IG_SETTING:
					switch(recv1[CMD_SCMD_POS]){

