sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
					}
					break;

				//-----------------------------------------------------
				case M_CMD_4G_SETTING:
					switch(recv1[CMD_SCMD_POS]){

					}
					break;

				//-----------------------------------------------------
				default:
					break;

			}

			if(TRUE == send2host){
				xFer[MCU_ID_POS] = MCU_REPO_ID;
				switch(recv1[CMD_MCMD_POS]){
					//-----------------------------------------------------
					case M_CMD_MCU_SETTING:
						xFer[1] = M_CMD_MCU_SETTING;
						break;
					//-----------------------------------------------------
					case M_CMD_IG_SETTING:
						xFer[1] = M_CMD_IG_SETTING;
						break;

					//-----------------------------------------------------
					case M_CMD_4G_SETTING:
						xFer[1] = M_CMD_4G_SETTING;
						break;
				}

				xFer[xFer_len] = CMD_ETX_CODE; 		// ETX code.
				xFer[xFer_len + 1] = 0x00; 			// Check sum.
				xFer[xFer_len + 2] = CMD_EOT_CODE;	// EOT code.
				xFer_len += CMD_TAIL_SIZE;
				// Start to transmit to host.
				HAL_UART_Transmit_DMA(&huart1, xFer, xFer_len);
				send2host = FALSE;
				xFer_len = 0;
			}
		}
		memset(recv1, 0, CMD_MAX_LEN);
		osDelay(UART1_TASK_ENTRY_TIME);
	}


  /* USER CODE END usart1_entry */
}

/* usart2_entry function */
void usart2_entry(void const * argument)
{
  /* USER CODE BEGIN usart2_entry */
	uint8_t recv2[2] = {0};
	//uint8_t recv2 = 0;
	//HAL_StatusTypeDef u2_states = HAL_OK;
    /* Infinite loop */
    for(;;)
    {
		/*if(HAL_UART_Receive_DMA(&huart2, (uint8_t*)&recv2, 1) == HAL_OK){
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&recv2, 1);
		}*/


    	/*##-2- Start the transmission process #####################################*/
    	  /* While the UART in reception process, user can transmit data through
    	     "aTxBuffer" buffer */
    	#if 0
    	if(HAL_UART_Transmit(&huart2, "+CSQ: 2,5", 10, 5000)!= HAL_OK)
    	  {
    	    Error_Handler();
    	  }


    	  /*##-3- Put UART peripheral in reception process ###########################*/
    	  if(HAL_UART_Receive(&huart2, (uint8_t *)recv2, 10, 5000) != HAL_OK)
    	  {
    	    Error_Handler();
    	  }



    	  if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 10)!= HAL_OK)
    	{
    		Error_Handler();
    	}

    	while (UartReady != SET)
		  {
		  }
#endif

    	HAL_UART_Transmit(&huart2, "AT+CNMI=1,1", 11, 30);
    	if(HAL_UART_Receive(&huart2, (uint8_t*)&recv2, 2, 3000)==HAL_OK)
    	{
    		HAL_UART_Transmit(&huart2, "AAAAAA", 6, 30);
    	}




#if 0
		if((u2_states = HAL_UART_Receive(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT)) == HAL_OK){
			HAL_UART_Transmit(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT);
		}
		else if (u2_states == HAL_TIMEOUT){
			HAL_UART_Abort(&huart2);
		}
#endif
		osDelay(50);
    }
  /* USER CODE END usart2_entry */
}

/* usart3_entry function */
void usart3_entry(void const * argument)
{
  /* USER CODE BEGIN usart3_entry */
	uint8_t recv3[4] = {0};
	int temp;
	uint8_t *cml_head, *cml_limit, *cml_ptr = cml_array;
	HAL_StatusTypeDef u3_states = HAL_OK;
	cml_head = cml_limit = cml_ptr;
	uint8_t cnt = 0;
	/* Infinite loop */
	for(;;)
	{
#if (0)
		//recv3[0] = recv3[1] = recv3[2] = 0;
		osMutexWait(MUTEX_DebugHandle, osWaitForever);
		if(HAL_UART_Receive(&huart3, (uint8_t*)&recv3[0], 1, 1) == HAL_OK){
			if (HAL_UART_Receive(&huart3, (uint8_t*)&recv3[1], 1, 1) != HAL_OK){
				switch(recv3[0]){
					case '\0':
						break;
					//-----------------------------------------------------
					case '\r':
					case '\n':
						HAL_UART_Transmit(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1, sizeof(SVA_1000_NL) - 1);
						*cml_limit = '\0';
						osMutexWait(MUTEX_CMD_PROCHandle, osWaitForever);
						memcpy(cml_proc, cml_array, (uint32_t)(cml_limit - cml_head + 1));
						osMutexRelease(MUTEX_CMD_PROCHandle);
						cml_ptr = cml_limit = cml_head;

						break;

					//-----------------------------------------------------
					/* Delete Key. */
					case 0x7E:

						break;
					//-----------------------------------------------------
					case 0x7F:
						recv3[0] = '\b';

					case '\b':
						if ((cml_ptr > cml_head) && (cml_limit > cml_head)){
							temp = cml_limit - cml_ptr;
							*(--cml_ptr) = 0;
							strncpy(cml_ptr, (cml_ptr + 1), temp);
							HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
							HAL_UART_Transmit(&huart3, cml_ptr, temp, temp);
							HAL_UART_Transmit(&huart3, " ", 1, 1);
							//HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, UART3_TIMEOUT);


							for(temp = 0; temp < cml_limit - cml_ptr; temp++){
								HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
							}
							*(--cml_limit) = 0;
						}

						//HAL_UART_Transmit_DMA(&huart3, " ", 1, 10);
						//HAL_UART_Transmit_DMA(&huart3, (uint8_t*)&recv3[0], 1, 1);
						break;

					//-----------------------------------------------------
					case '\e':
						break;

					//-----------------------------------------------------
					default:
						if (cml_ptr >= cml_head + MAX_CML_CHAR - 1){
							break;
						}
						*(cml_ptr++) = recv3[0];
						//cml_limit = cml_ptr;
						if(cml_limit < cml_ptr){
							cml_limit = cml_ptr;
						}
						HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
						break;
				}

			}
			else{
				if (HAL_UART_Receive(&huart3, (uint8_t*)&recv3[2], 1, 1) == HAL_OK){
					if (recv3[0] =='\e'){
						//recv3[0] = 0xE0;
						switch(recv3[2]){
						//-----------------------------------------------------
						// Up
						case 'A':
							//recv3[1] = 0x48;
							break;

						//-----------------------------------------------------
						// Down
						case 'B':
							//recv3[1] = 0x50;
							break;

						//-----------------------------------------------------
						// Right
						case 'C':
							//recv3[1] = 0x4D;

							if (cml_ptr < cml_limit){
								cml_ptr++;
								HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 3, 2);
							}

							break;

						//-----------------------------------------------------
						// Left
						case 'D':
							if (cml_ptr > cml_head){
								cml_ptr--;
								HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 3, 2);
							}
							break;

						//-----------------------------------------------------
						default:
							break;

