sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
			//-------------------------------------------------------------------------------------
			case IG_Wait_StartUp:
				/* Power button has been (long) pressed. */
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					ig_event.pwrbtn_pressed = TRUE;
					if(0 == (ig_event.pwroff_btn_cnt--)){
						ig_event.IG_States = IG_Recovery;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_Recovery");
					}
				}

				if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					ig_event.pwrbtn_pressed = FALSE;
				}

				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					if (0 == (ig_event.wait_startup_time--)){
						ig_event.wait_startup_time = gIG_Event.wait_startup_time;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);
						// Confirm the the DC2DC power and system power are available.
						while((sva_gpi.dc2dc_pwrok != GPIO_PIN_SET) || (sva_gpi.sys_pwron == GPIO_PIN_SET)){
							if(0 == (ig_event.pwrgood_chk_time--)){
								break;
							}
						}
						if(0 != ig_event.pwrgood_chk_time){
							ig_event.IG_States = IG_Start_Up;
							aewin_dbg("\n\rPower on delay ok! IG_Wait_StartUp --> IG_Start_Up");
						}
						else{
							HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
							ig_event.IG_States = IG_CloseUp;
							aewin_dbg("\n\rDE2DC Power on failed! IG_Wait_StartUp --> IG_CloseUp");
						}
						ig_event.pwrgood_chk_time = gIG_Event.pwrgood_chk_time;
					}
				}
				else{
					ig_event.wait_startup_time = gIG_Event.wait_startup_time;
					ig_event.IG_States = IG_PowerOn_Delay;
					aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_PowerOn_Delay");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Start_Up:
				if(ig_event.startup_timeout > 0){
					/* Lock ignition off to prevent that user shutdowns the OS. */
					ig_event.startup_timeout--;
					aewin_dbg("\n\rLock power on!");
				}
				else{
					if( sva_gpi.ig_sw ==  GPIO_PIN_RESET){
						ig_event.IG_States = IG_Shutdown_Delay;
						aewin_dbg("\n\rIngition switch off! IG_Start_Up --> IG_Shutdown_Delay");
					}
				}

				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					ig_event.pwrbtn_pressed = TRUE;
					if(0 == (ig_event.pwroff_btn_cnt--)){
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						ig_event.IG_States = IG_Recovery;
					}
				}

				if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					ig_event.pwrbtn_pressed = FALSE;
					ig_event.IG_States = IG_shutting_Down;
					aewin_dbg("\n\rPower button off! IG_Start_Up --> IG_shutting_Down");
				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_Shutdown_Delay:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					if (0 == (ig_event.pwroff_delay--)){
						ig_event.IG_States = IG_shutting_Down;
						ig_event.pwroff_delay = gIG_Event.pwroff_delay;
						aewin_dbg("\n\rPower off delay pass! IG_Shutdown_Delay --> IG_shutting_Down");
					}
				}
				else{
					ig_event.IG_States = IG_Start_Up;
					ig_event.pwroff_delay = gIG_Event.pwroff_delay;
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_Start_Up");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_shutting_Down:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					if (0 == (ig_event.shutdown_delay--)){
						ig_event.IG_States = IG_CloseUp;
						ig_event.shutdown_delay = gIG_Event.shutdown_delay;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						aewin_dbg("\n\rShutdown delay pass! IG_shutting_Down --> IG_CloseUp");
					}
				}
				else{
					ig_event.IG_States = IG_Shutdown_Delay;
					ig_event.shutdown_delay = gIG_Event.shutdown_delay;
					aewin_dbg("\n\rShutdown delay failed! IG_shutting_Down --> IG_Shutdown_Delay");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_LowPower_Delay:
				break;

		}
    	osDelay(INGITION_TASK_ENTRY_TIME);
    }
  /* USER CODE END ignition_entry */
}

/* i2c1_entry function */
void i2c1_entry(void const * argument)
{
  /* USER CODE BEGIN i2c1_entry */

	I2C_HandleTypeDef I2cHandle;
	/* Buffer used for reception */
	uint8_t ADXL345_RxBuffer[6];
	//uint8_t regptr = I2C_MEM_ADDRESS_ADXL345;
	uint8_t regptr = 0x00;

	I2cHandle.Instance = I2C1;
	I2cHandle.Init.Timing = 0x20303E5D;
	I2cHandle.Init.OwnAddress1 = 0;
	I2cHandle.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	I2cHandle.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	I2cHandle.Init.OwnAddress2 = 0;
	I2cHandle.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	I2cHandle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	I2cHandle.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&I2cHandle) != HAL_OK)
	{
	_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure Analogue filter
	*/
	if (HAL_I2CEx_ConfigAnalogFilter(&I2cHandle, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
	{
	_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure Digital filter
	*/
	if (HAL_I2CEx_ConfigDigitalFilter(&I2cHandle, 0) != HAL_OK)
	{
	_Error_Handler(__FILE__, __LINE__);
	}

    /* Infinite loop */
	for(;;)
	{
		HAL_SMBUS_Master_Transmit_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345, &regptr, 1, SMBUS_AUTOEND_MODE);
		//HAL_Delay(10);
		HAL_SMBUS_Master_Receive_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345,  ADXL345_RxBuffer, 6, SMBUS_AUTOEND_MODE);


#if 0
		/* While the I2C in reception process, user can transmit data through
			 "aTxBuffer" buffer */
		  /* Timeout is set to 10S */
		  while(HAL_I2C_Master_Transmit(&I2cHandle, (uint16_t)0xE5, &regptr, 1, 10)!= HAL_OK)
		  {
			/* Error_Handler() function is called when Timeout error occurs.
			   When Acknowledge failure occurs (Slave don't acknowledge its address)
			   Master restarts communication */
			if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF)
			{
			  Error_Handler();
			}
		  }

		  while(HAL_I2C_Master_Receive(&I2cHandle, (uint16_t)0xE5, (uint8_t *)ADXL345_RxBuffer, 6, 10000) != HAL_OK)
		  {
			  /* Error_Handler() function is called when Timeout error occurs.
				 When Acknowledge failure occurs (Slave don't acknowledge it's address)
				 Master restarts communication */
			  if (HAL_I2C_GetError(&I2cHandle) != HAL_I2C_ERROR_AF)
			  {
				Error_Handler();
			  }
		   }


		  //if(HAL_I2C_Master_Receive_DMA(&I2cHandle, (uint16_t)I2C_DEV_ADDRESS_ADXL345, (uint8_t *)ADXL345_RxBuffer, BUFFER_SIZE_ADXL345) != HAL_OK)
		if(HAL_I2C_Mem_Read_DMA( &I2cHandle,  0xE5,  0x32, I2C_MEMADD_SIZE_8BIT,  (uint8_t *)ADXL345_RxBuffer,  6) != HAL_OK)
		{
		  /* Error_Handler() function is called when error occurs. */
		  Error_Handler();
		}

